close all
clear all
clc
global x_0 x_End
global y_0 y_End
global t_0 t_End
global R E1 E2 A10 A20
global k b
global c cUp cD
global AD BD CD DD AUp BUp CUp DUp
global lambda
%--------------------------------------------------------------------------
%-------------------------Константы реактора-------------------------------
R=8.3;
E1=2.09e4;
E2=4.18e4;
A10=1.1;
A20=172.2; 
%----------------------Коэффициенты управления-----------------------------
a0=4.3145;
a1=-0.1099;
b0=1.4962;
b1=0.0515;
g1=41.8;
g2=83.6;
%--------------------------------------------------------------------------
t_0=0;
%t_End=10;
h_t=0.05;       %шаг по времени t
%--------------------------------------------------------------------------

global N    %число разбиений
N=100;

x_0=[0.993 0.007 298];
x_End=[0.693 0.3 333];
%--------------------------------------------------------------------------
%Граничные значения канонических переменных
y_0=YTrans(x_0);
y_End=YTrans(x_End);
%--------------------параметры стабилизации--------------------------------
c_st=[1 0.25];
%--------------------------------------------------------------------------
k=(y_End(2)-y_0(2))/(y_End(1)-y_0(1));
b=(y_0(2)*y_End(1)-y_End(2)*y_0(1))/(y_End(1)-y_0(1));
%--------------------------------------------------------------------------
%[cUp cD]=CAnalyses();
%-------------------------0<=v<=1------------------------------------------
cUp=0.67;
cD=-38.48;
%--------------------------------------------------------------------------
%cUp=1.3;
%cD=-10.94;
%--------------------------------------------------------------------------
c=cUp;
tau_EndUp=quad(@yParab,y_0(1),y_End(1));
c=cD;
tau_EndD=quad(@yParab,y_0(1),y_End(1));
%--------------------------------------------------------------------------
% dy=(y_End(1)-y_0(1))/1000;
% x=y_0(1):dy:y_End(1);
% %figure(1); hold on; grid on;
% Y=[];
% for y=y_0(1):dy:y_End(1)
%     Y=[Y k*y+b+cUp*(y-y_0(1))*(y_End(1)-y)];
% end
% %plot(x,Y);
% disp(max(Y));
% %figure(2); hold on; grid on;
% 
% Y=[];
% for y=y_0(1):dy:y_End(1)
%     Y=[Y k*y+b+cD*(y-y_0(1))*(y_End(1)-y)];
% end
% %plot(x,Y);
% disp(min(Y));
%--------------------------------------------------------------------------
% AD=-cD;
% BD=k+cD*y_0(1)+cD*y_End(1);
% CD=b-cD*y_0(1)*y_End(1);
% DD=BD^2-4*AD*CD;
% 
% AUp=-cUp;
% BUp=k+cUp*y_0(1)+cUp*y_End(1);
% CUp=b-cUp*y_0(1)*y_End(1);
% DUp=BUp^2-4*AUp*CUp;
% if (AD>0)&&(DD<0)
%     tau_EndD=2/(-DD)^0.5*(atan(2*AD/(-DD)^0.5*y_End(1)+BD/(-DD)^0.5)-atan(2*AD/(-DD)^0.5*y_0(1)+BD/(-DD)^0.5));
% elseif (AD<0)&&(DD>0)
%     tau_EndD=1/DD^0.5*(log((-AD)^0.5*y_End(1)+(-BD+DD^0.5)/2/(-AD)^0.5)-log((-AD)^0.5*y_End(1)+(-BD-DD^0.5)/2/(-AD)^0.5))...
%         -1/DD^0.5*(log((-AD)^0.5*y_0(1)+(-BD+DD^0.5)/2/(-AD)^0.5)-log((-AD)^0.5*y_0(1)+(-BD-DD^0.5)/2/(-AD)^0.5));
% end
% if (AUp>0)&&(DUp<0)
%     tau_EndUp=2/(-DUp)^0.5*(atan(2*AUp/(-DUp)^0.5*y_End(1)+BUp/(-DUp)^0.5)-atan(2*AUp/(-DUp)^0.5*y_0(1)+BUp/(-DUp)^0.5));
% elseif (AUp<0)&&(DUp>0)
%     tau_EndUp=1/DUp^0.5*(log((-AUp)^0.5*y_End(1)+(-BUp+DUp^0.5)/2/(-AUp)^0.5)-log((-AUp)^0.5*y_End(1)+(-BUp-DUp^0.5)/2/(-AUp)^0.5))...
%         -1/DUp^0.5*(log((-AUp)^0.5*y_0(1)+(-BUp+DUp^0.5)/2/(-AUp)^0.5)-log((-AUp)^0.5*y_0(1)+(-BUp-DUp^0.5)/2/(-AUp)^0.5));
% end
%--------------------------------------------------------------------------
lambda=0.3;
tau_End=lambda*tau_EndD+(1-lambda)*tau_EndUp;
YPsi=Euler(tau_End);
disp(YPsi(2));
%------------------Test----------------------------------------------------
dtau=tau_End/10000;
tau=0;
i=1;
x_t=y_0;
while tau<tau_End
    U=Control(tau);
    u=U(1,1);
    x_t(i+1,1)=x_t(i,1)+dtau*x_t(i,2);
    x_t(i+1,2)=x_t(i,2)+dtau*(fKan(x_t(i,:),tau)+gKan(x_t(i,:),tau)*u);
    i=i+1;
    tau=tau+dtau;
end
sss=U(6:9,1);
%--------------------------------------------------------------------------